cd ~/lab0

Рекурсивно подсчитать количество строк содержимого файлов из директории lab0, имя которых начинается на 'p', 
отсортировать вывод по уменьшению количества, 
подавить вывод ошибок доступа

Вывести три первых элемента рекурсивного списка имен и атрибутов файлов в директории lab0, содержащих строку "me", список отсортировать по убыванию даты модификации файла, ошибки доступа перенаправить в файл в директории /tmp

Вывести содержимое файлов с номерами строк в директории palpitoad1, исключить строки, содержащие "vo", регистр символов игнорировать, подавить вывод ошибок доступа

Вывести список имен и атрибутов файлов в директории empoleon2, список отсортировать по возрастанию даты модификации файла, подавить вывод ошибок доступа

Вывести рекурсивно список имен и атрибутов файлов в директории lab0, заканчивающихся на символ '1', список отсортировать по имени a->z, добавить вывод ошибок доступа в стандартный поток вывода

Вывести рекурсивно список имен и атрибутов файлов в директории lab0, содержащих строку "me", список отсортировать по убыванию даты доступа к файлу, подавить вывод ошибок доступа


wc -m ./m* >/tmp/225117lab0 2>/dev/null

ls -lR 2>/tmp/225227lab0 | grep studs | grep -v '^d'| grep d* | sort -k 2,2

cat -n kingdra2 | sort -k 2,2

chmod u+r darumaka2
cat *p */*p */*/*p */*/*/*p 2>&1 | sort

wc -l d* */d* */*/d* */*/*/d* 2>/tmp/s225117err | sort -r

chmod u+r darumaka2/klang
chmod u+rx porygonz1/charmeleon
cat -n darumaka2/klang darumaka2/shelmet darumaka2/zweilous porygonz1/charmeleon 2>/dev/null | grep '*t$'

cd ..
